from datetime import datetime, timedelta

schedule = {
    "понедельник": {
        "8.00-9.20": [
            [["5 лекция", "7 лекция"], "Технология информационно-дискуссионной деятельности\nдоц. Сочнева Е.С."],
            [["6 практическая", "8-10 практическая", "12 практическая"],
             "(1 подгруппа)\nТехнология информационно-дискуссионной деятельности\nст. преп. Кириченко А.Г."],
        ],
        "9.35-10.55": [
            [["1 практическая"],
             "Технология создания шоу-программ\nст. преп. Кочеткова Л.Н.\nст. преп. Кириченко А.Г."],
            [["2-3 лекция"], "Методы исследований в социальнокультурной деятельности\nдоц. Рогачева О.В."],
            [["4-8 лекция", "12-13 лекция", "9-10 практическая", "14 практическая"],
             "Методическое обеспечение социально-культурной деятельности\nпроф. Самерсова Н.В. - лекция\nпреп. Новик С.А. - практическая"],
        ],
        "11.10-12.30": [
            [["1 практическая", "13-14 практическая"],
             "Технологии создания шоу-программ\nст. преп. Кочеткова Л.Н.\nст. преп. Кириченко А.Г."],
            [["2-6 практическая"], "Методы исследований в социальнокультурной деятельности\nдоц. Рогачева О.В."],
            [["7-10 практическая", "12 практическая"],
             "Методическое обеспечение социально-культурной деятельности\nпреп. Новик С. А"],
        ],
    },
    "вторник": {
        "8.00-9.20": [
            [["8-9 практическая"], "Технология игровой деятельности\nст. преп. Байко А.П.\nпреп. Мармулевская М.Ю."],
            [["13-16 практическая"],
             "Нормативно-правовое обеспечение социально-культурной деятельности\nпреп. Новик С.А."],
        ],
        "9.35-10.55": [
            [["1-10 практическая", "12-14 практическая"],
             "Иностранный язык (спецлексика)\nст. преп. Гутковская М.С., ст. преп. Кудрявцева Е.Л., ст. преп. Платонова Э.Е.,ст. преп. Попова Д.Б., ст. преп. Лебедева Д.В."],
        ],
        "11.10-12.30": [
            [["1-10 практическая"],
             "Технологии создания шоу-программ\nст. преп. Кочеткова Л.Н.\nст. преп. Кириченко А.Г."],
            [["12-16 практическая"],
             "Технология информационно-дискуссионной деятельности\nст. преп. Кириченко А.Г.\nпреп. Новик С.А."],
        ],
    },
    "среда": {
        "8.00-9.20": [
            [["3-13 лекция"],
             "Великая отечественная война советского народа (в контексте второй мировой войны) \nдоц. Бомбешко И.И."],
        ],
        "9.35-10.55": [
            [["1-8 лекция", "10-11 практическая"],
             "Методы исследований в социально-культурной деятельности\nдоц. Рогачева О.В"],
            [["9 семинар", "12 семинар", "14 семинар"],
             "Великая отечественная война советского народа (в контексте второй мировой войны) \nдоц. Бомбешко И.И."],
            [["13 практическая", "15 практическая", ],
             "Нормативно-правовое обеспечение социальнокультурной деятельности\nпреп. Новик С.А."],
        ],
        "11.10-12.30": [
            [["1-2 практическая"], "Методическое обеспечение социально-культурной деятельности\nпреп. Новик С. А."],
            [["3-10 семинар", "12-16 семинар"], "Философия\nст.преп. Еськевич К.Р."]
        ]
    },
    "четверг": {
        "8.00-9.20": [
            [["1-10 практическая", "12-16 практическая"],
             "Иностранный язык (спецлексика)\nст. преп. Безмен С.Г., ст. преп. Платонова Э.Е., ст. преп. Лебедева Д.В., ст. преп. Лубинская Е.П., ст. преп. Лещенко Н.В., преп. Богданович И.С."],
        ],
        "9.35-10.55": [
            [["1-6 лекция"], "Контент-оформление культурно-досуговых программ\nст. преп. Байко А.П."],
            [["7-10 лекция", "12-14 лекция"], "Социальная и возрастная психология\nст. преп. Еремеенкова Т.Н."],
        ],
        "11.10-12.30": [
            [["13-14 семинар"], "Социальная и возрастная психология\nст. преп. Еремеенкова Т.Н."],
            [["16 семинар"], "Теория, история и технологии социально-культурной деятельности\nпроф. Макарова Е.А."]
        ],
        "13.00-14.20": [
            [["1-16 лекция"], "Кураторский / информационный час\nкуратор Иовлева Ю.Ю."],
        ],
    },
    "пятница": {
        "8.00-9.20": [
            [["1-11 практическая", "13 практическая"],
             "Технология игровой деятельности\nст. преп. Байко А.П\n, преп. Мармулевская М.Ю."],
            [["14-16 практическая", ],
             "(2 подгруппа)\nТехнология информационно-дискуссионной деятельности\nпреп. Новик С.А."],
        ],
        "9.35-10.55": [
            [["1-11 практическая", "13 практическая"],
             "Контент-оформление культурно-досуговых программ\nст. преп. Байко А.П."],
            [["14-15 практическая", ],
             "(2 подгруппа)\nТехнология информационно-дискуссионной деятельности\nпреп. Новик С.А."],
        ],
        "11.10-12.30": [
            [["7-11 лекция", "13 лекция", "14-15 практическая"],
             "Нормативно-правовое обеспечение социальнокультурной деятельности\nдоц. Камоцкий М.В. - лекция.\n преп.Новик С.А. - практическая"],
        ],
    },
    "суббота": {
        "8.00-9.20": [
            [["1 лекция"], "Философия\nст.преп. Еськевич К.Р."],
        ],
        "9.35-10.55": [
            [["1-2 лекция", "4-8 лекция", "10-15 лекция"], "Философия\nст.преп. Еськевич К.Р."],
        ],
        "11.10-12.30": [
            [["1-2 лекция", "4-7 лекция"], "Социальная и возрастная психология\nдоц. Бараева Е.И"],
            [["8-10 лекция", "11-15 практическая"],
             "Технология информационно-дискуссионной деятельности\nдоц. Сочнева Е.С. - лекция\n ст. преп. Кириченко А.Г. - практическая"],
        ],
        "13.00-14.20": [
            [["5 семинар", "8-9 семинар"], "Социальная и возрастная психология\nдоц. Бараева Е.И"],
        ],
    }
}

day_name_russian_map = {
    "monday": "понедельник",
    "tuesday": "вторник",
    "wednesday": "среда",
    "thursday": "четверг",
    "friday": "пятница",
    "saturday": "суббота",
}

start_date = datetime(2025, 2, 17)


def get_week_number(date):
    return ((date - start_date).days // 7) + 1


def get_type_lesson(lesson: str):
    match lesson:
        case 'лекция':
            return '📖 Лекция 🎓'
        case 'практическая':
            return '🛠 Практическая 📝'
        case 'семинар':
            return '💬 Семинар 🗣️'


def filter_lectures(lectures, week_number):
    result = []
    for lecture in lectures:
        week_ranges = lecture[0]
        for week_range in week_ranges:
            wr, tp = week_range.split()
            if '-' in wr:
                start, end = map(int, wr.split('-'))
                if start <= week_number <= end:
                    result.append(f'{get_type_lesson(tp)}\n{lecture[1]}')

            else:
                if int(wr) == week_number:
                    result.append(f'{get_type_lesson(tp)}\n{lecture[1]}')
    return result


def get_current_week_monday():
    today = datetime.now()
    current_weekday = today.weekday()
    monday = today - timedelta(days=current_weekday)
    return monday


def get_schedule_message_for_week(next_week=False):
    monday = get_current_week_monday()
    current_week_number = get_week_number(monday)
    if next_week:
        current_week_number += 1
    msg = f'📆 #расписание на {current_week_number} учебную неделю\n'
    for i in range(6):
        day = monday + timedelta(days=i)
        day_name = day.strftime("%A").lower()
        if next_week:
            day += timedelta(days=7)

        day_name_russian = day_name_russian_map[day_name]
        color_point = ''
        match day_name_russian:
            case 'понедельник':
                color_point = '🟡'
            case 'вторник':
                color_point = '🟢'
            case 'среда':
                color_point = '🔵'
            case 'четверг':
                color_point = '🟠'
            case 'пятница':
                color_point = '🟣'
            case 'суббота':
                color_point = '🔴'
        msg += f"\n{color_point} <b>{day_name_russian.upper()}({day.strftime('%d.%m')})</b>\n\n"

        if day_name_russian in schedule:
            for time, lectures in schedule[day_name_russian].items():
                filtered_lectures = filter_lectures(lectures, current_week_number)
                if filtered_lectures:
                    msg += f"<b>{time}:</b>\n"
                    for lecture in filtered_lectures:
                        msg += f"{lecture}\n"
                    msg += "\n"

    return msg
