from datetime import datetime, timedelta

schedule = {
    "понедельник": {
        "8.30-9.50": [
            [["1-2 лекция"], "Культурология\nдоц. Кнатько Ю.И."],
            [["4-9 практическая", "11-13 практическая"], "Технология игровой деятельности\nст. преп. Байко А.П."],
            [["15-17 семинар"], "Современная политэкономия\nпроф. Языкович В.Р."]
        ],
        "10.05-11.25": [
            [["1-7 лекция"], "Технология игровой деятельности\nпроф. Козловская Л.И."],
            [["8-16 лекция"], "Общая психология\nст. преп. Гудзенко Л.Г."]
        ],
        "12.00-13.20": [
            [["2-3 лекция"], "Технологии создания шоу-программ\nст. преп. Кириченко А.Г."],
            [["4-17 практическая"],
             "Режиссура культурно-досуговых программ\nст. преп. Астрединова Р.Н.\nпреп. Иовлева Ю.Ю."]
        ],
        "13.35-14.55": [
            [["6-17 практическая"],
             "Режиссура культурно-досуговых программ\nст. преп. Астрединова Р.Н.\nпреп. Иовлева Ю.Ю."]
        ]
    },
    "вторник": {
        "8.30-9.50": [
            [["2-3 лекция"], "Технологии создания шоу-программ\nст. преп. Кириченко А.Г."],
            [["10-14 семинар"], "Современная политэкономия\nст. преп. Ковальчук Л.С."],
            [["15-16 семинар"], "Основы права\nдоц. Адамюк О.И."]
        ],
        "10.05-11.25": [
            [["1-3 лекция"], "Мировая литература\nпроф. Булацкая Н.А."],
            [["4-14 лекция"], "Современная политэкономия\nст. преп. Ковальчук Л.С."],
            [["15-17 семинар"], "Мировая литература\nпроф. Булацкая Н.А."]
        ],
        "12.00-13.20": [
            [["1-2 лекция"], "Мировая литература\nпроф. Булацкая Н.А."],
            [["5-15 лекция", "16 семинар"], "Основы права\nдоц. Адамюк О.И."],
            [["3-13 лекция", "14-16 семинар"], "Социология\nпроф. Безнюк Д.К."]
        ]
    },
    "среда": {
        "8.30-9.50": [
            [["3-8 практическая"], "Технологии создания шоу-программ\nст. преп. Кириченко А.Г."],
            [["12-13 семинар"], "Этнокультурология\nпроф. Смолик А.И."],
            [["14-16 семинар"], "Современная политэкономия\nпроф. Языкович В.Р."]
        ],
        "10.05-11.25": [
            [["1-11 лекция"], "Мировая литература\nпроф. Булацкая Н.А."],
            [["12-13 лекция"], "Современная политэкономия\nпроф. Языкович В.Р."],
            [["14-16 семинар"], "Этнокультурология\nпроф. Смолик А.И."]
        ],
        "12.00-13.20": [
            [["1-2 лекция"], "Этнокультурология\nпроф. Смолик А.И."],
            [["3-5 лекция"], "Технология игровой деятельности\nпроф. Козловская Л.И."],
            [["9-10 практическая"], "Технологии создания шоу-программ\nст. преп. Кириченко А.Г."],
            [["11-16 семинар"], "Мировая литература\nпроф. Булацкая Н.А."]
        ]
    },
    "четверг": {
        "8.30-9.50": [
            [["14-17 семинар"], "Общая психология\nст. преп. Гудзенко Л.Г."]
        ],
        "10.05-11.25": [
            [["1-2 лекция"], "Общая психология\nст. преп. Гудзенко Л.Г."],
            [["3-9 лекция", "11-13 лекция"], "Этнокультурология\nпроф. Смолик А.И."],
            [["14-15 лекция"], "Современная политэкономия\nпроф. Языкович В.Р."]
        ],
        "12.00-13.20": [
            [["1-3 лекция"], "Этнокультурология\nпроф. Смолик А.И."],
            [["13-14 практическая", "16-17 практическая"],
             "Режиссура культурно-досуговых программ\nст. преп. Астрединова Р.Н.\nпреп. Иовлева Ю.Ю."],
            [["15 семинар"], "Современная политэкономия\nпроф. Языкович В.Р."],
            [["16 семинар"], "Теория, история и технологии социально-культурной деятельности\nпроф. Макарова Е.А."]
        ]
    },
    "пятница": {
        "8.30-9.50": [
            [["2 практическая"], "Технология игровой деятельности\nст. преп. Байко А.П."],
            [["6-9 практическая", "11-15 практическая", "17 практическая"],
             "Режиссура культурно-досуговых программ\nст. преп. Астрединова Р.Н.\nпреп. Иовлева Ю.Ю."]
        ],
        "10.05-11.25": [
            [["1-2 лекция"], "Технологии создания шоу-программ\nст. преп. Кириченко А.Г."],
            [["3 лекция"], "Общая психология\nст. преп. Гудзенко Л.Г."],
            [["4-9 практическая", "11-15 практическая", "17 практическая"],
             "Режиссура культурно-досуговых программ\nст. преп. Астрединова Р.Н.\nпреп. Иовлева Ю.Ю."],
            [["16 лекция"], "Современная политэкономия\nпроф. Языкович В.Р."]
        ],
        "12.00-13.20": [
            [["1-2 лекция"], "Общая психология\nст. преп. Гудзенко Л.Г."],
            [["13-14 семинар"], "Современная политэкономия\nпроф. Языкович В.Р."]
        ]
    },
    "суббота": {
        "10.05-11.25": [
            [["5-6 лекция"], "Общая психология\nст. преп. Гудзенко Л.Г."]
        ],
        "12.00-13.20": [
            [["1-9 лекция", "11 лекция", "12-14 семинар"], "Культурология\nдоц. Кнатько Ю.И."]
        ],
        "13.35-14.55": [
            [["1-9 лекция", "11 лекция", "12-14 семинар"], "Культурология\nдоц. Кнатько Ю.И."]
        ]
    }
}

day_name_russian_map = {
    "monday": "понедельник",
    "tuesday": "вторник",
    "wednesday": "среда",
    "thursday": "четверг",
    "friday": "пятница",
    "saturday": "суббота",
}

start_date = datetime(2024, 9, 2)


def get_week_number(date):
    return ((date - start_date).days // 7) + 1


def filter_lectures(lectures, week_number):
    result = []
    for lecture in lectures:
        week_ranges = lecture[0]
        for week_range in week_ranges:
            wr, tp = week_range.split()
            if '-' in wr:
                start, end = map(int, wr.split('-'))
                if start <= week_number <= end:
                    result.append(f'{lecture[1]}({tp})')

            else:
                if int(wr) == week_number:
                    result.append(f'{lecture[1]}\n{tp}')
    return result


def get_current_week_monday():
    today = datetime.now()
    current_weekday = today.weekday()
    monday = today - timedelta(days=current_weekday)
    return monday


def get_schedule_message_for_week(next_week=False):
    monday = get_current_week_monday()
    current_week_number = get_week_number(monday)
    if next_week:
        current_week_number += 1
    msg = f'📆 #расписание на {current_week_number} учебную неделю\n'
    for i in range(6):
        day = monday + timedelta(days=i)
        day_name = day.strftime("%A").lower()
        if next_week:
            day += timedelta(days=7)

        day_name_russian = day_name_russian_map[day_name]
        color_point = ''
        match day_name_russian:
            case 'понедельник':
                color_point = '🟡'
            case 'вторник':
                color_point = '🟢'
            case 'среда':
                color_point = '🔵'
            case 'четверг':
                color_point = '🟠'
            case 'пятница':
                color_point = '🟣'
            case 'суббота':
                color_point = '🔴'
        msg += f"\n{color_point} <b>{day_name_russian.upper()}({day.strftime('%d.%m')})</b>\n\n"

        if day_name_russian in schedule:
            for time, lectures in schedule[day_name_russian].items():
                filtered_lectures = filter_lectures(lectures, current_week_number)
                if filtered_lectures:
                    msg += f"<b>{time}:</b>\n"
                    for lecture in filtered_lectures:
                        msg += f"{lecture}\n"

    return msg
